UFTOneAutomationTests/APITestCreateOrder/Result1/Report/Data/Step2.js

function _get_dyn_external_content_for_st(){return '<div><style>.basic-block table td.no-border{padding-left:0;}</style><div class="st-act-wrapper "><div class="block basic-block"><table><tr><td class="name col-head-style">Name</td><td class="name col-head-style">Step ID</td><td class="name col-head-style">Status</td><td class="name col-head-style">Message</td></tr><tr><td class="value col-head-style">GetFlights</td><td class="value col-head-style">StServiceCallActivity4</td><td class="value col-head-style">Done</td><td class="value col-head-style">Web service call performed successfully</td></tr></table></div><div class="block other-props-block"><div class="block-title">More</div><table><tr><td class="name row-head-style">InputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_InputXml_0c9687bc-80b9-47f9-bd28-0107d57565a4.xml\', \'Data/StServiceCallActivity4_InputXml_0c9687bc-80b9-47f9-bd28-0107d57565a4-js4hrpt.js\', \'.xml\', \'InputXml\');return false;">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;Body&gt;\r\n    &lt;GetFlights xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n      &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n      &lt;FlightDate&gt;2115-02-28T00:00:00&lt;/FlightDate&gt;\r\n    &lt;/GetFlights&gt;\r\n  &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">Service</td><td class="value row-head-style">Flights_Service</td></tr><tr><td class="name row-head-style">Port</td><td class="value row-head-style">FlightsServiceMethods</td></tr><tr><td class="name row-head-style">Operation</td><td class="value row-head-style">GetFlights</td></tr><tr><td class="name row-head-style">Address</td><td class="value row-head-style">http://localhost:8000/Flights_SOAP</td></tr><tr><td class="name row-head-style">SOAPAction</td><td class="value row-head-style">HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights</td></tr><tr><td class="name row-head-style">ContentType</td><td class="value row-head-style">text/xml; charset=utf-8</td></tr><tr><td class="name row-head-style">MessageExchangePattern</td><td class="value row-head-style">Request Response</td></tr><tr><td class="name row-head-style">Full request</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_Full_request_5425bb2a-24b6-4ecb-9629-3df170bc2227.xml\', \'Data/StServiceCallActivity4_Full_request_5425bb2a-24b6-4ecb-9629-3df170bc2227-js4hrpt.js\', \'.xml\', \'Full request\');return false;">&lt;?xml version="1.0"? ... &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">InputHeader</td><td class="value row-head-style">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights\nContent-Type:	text/xml; charset=utf-8\nHost:	localhost:8000\nContent-Length:	261\nConnection:	Close\n</td></tr><tr><td class="name row-head-style">OutputHeader</td><td class="value row-head-style">Connection:	close\nContent-Length:	4207\nContent-Type:	text/xml; charset=utf-8\nDate:	Sun, 03 Jul 2022 17:29:02 GMT\nServer:	Microsoft-HTTPAPI/2.0\n</td></tr><tr><td class="name row-head-style">OutputText</td><td class="value row-head-style">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;08:53 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:09 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;1435&lt;/FlightNumber&gt;&lt;Price&gt;109.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;08:45 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3227&lt;/FlightNumber&gt;&lt;Price&gt;103.9&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;11:09 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;10:24 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3231&lt;/FlightNumber&gt;&lt;Price&gt;105.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;UA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;02:48 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3233&lt;/FlightNumber&gt;&lt;Price&gt;166.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;01:33 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3235&lt;/FlightNumber&gt;&lt;Price&gt;108.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;UA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;04:18 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3236&lt;/FlightNumber&gt;&lt;Price&gt;174.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DL&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;04:42 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3238&lt;/FlightNumber&gt;&lt;Price&gt;175.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;03:57 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3239&lt;/FlightNumber&gt;&lt;Price&gt;103.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;01:41 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:57 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3418&lt;/FlightNumber&gt;&lt;Price&gt;170.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;10:05 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;09:21 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3564&lt;/FlightNumber&gt;&lt;Price&gt;124.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;05:17 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;04:33 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;4941&lt;/FlightNumber&gt;&lt;Price&gt;177.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;07:41 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;06:57 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6065&lt;/FlightNumber&gt;&lt;Price&gt;122.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;12:29 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;11:45 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6087&lt;/FlightNumber&gt;&lt;Price&gt;111.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;11:00 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6226&lt;/FlightNumber&gt;&lt;Price&gt;173.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;04:05 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:21 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;7465&lt;/FlightNumber&gt;&lt;Price&gt;122.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;02:53 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;02:09 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;7854&lt;/FlightNumber&gt;&lt;Price&gt;125.2&lt;/Price&gt;&lt;/Flight&gt;&lt;/GetFlightsResult&gt;&lt;/GetFlightsResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</td></tr><tr><td class="name row-head-style">HttpStatusCode</td><td class="value row-head-style">200 : OK</td></tr><tr><td class="name row-head-style">OutputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_OutputXml_26529fb8-4790-4069-8bba-aff11019a9a1.xml\', \'Data/StServiceCallActivity4_OutputXml_26529fb8-4790-4069-8bba-aff11019a9a1-js4hrpt.js\', \'.xml\', \'OutputXml\');return false;">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;s:Body&gt;\r\n    &lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;DA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;08:53 AM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;08:09 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;1435&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;109.2&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;08:45 AM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;3227&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;103.9&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;11:09 AM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;10:24 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;3231&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;105.2&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;UA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;02:48 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;3233&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;166.2&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;01:33 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;3235&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;108.8&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;UA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;04:18 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;3236&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;174.47&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;DL&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;04:42 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;3238&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;175.47&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;03:57 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;3239&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;103.4&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;DA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;01:41 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;12:57 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;3418&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;170.47&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;DA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;10:05 AM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;09:21 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;3564&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;124.4&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;DA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;05:17 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;04:33 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;4941&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;177.47&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;DA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;07:41 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;06:57 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;6065&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;122.8&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;DA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;12:29 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;11:45 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;6087&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;111.2&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;11:00 AM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;6226&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;173.47&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;DA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;04:05 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;03:21 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;7465&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;122.8&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;DA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;02:53 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;02:09 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;7854&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;125.2&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n      &lt;/GetFlightsResult&gt;\r\n    &lt;/GetFlightsResponse&gt;\r\n  &lt;/s:Body&gt;\r\n&lt;/s:Envelope&gt;</a></td></tr> </table></div></div>';}